<?php
// 아래처럼 별을 찍어주세요.
// 예시)
// *****
// *****
// *****
// *****
// *****
// $col = 5;
// $row = 5;
for($i=0; $i<25; $i++){
    echo "*";
    if($i===4 || $i===9 || $i===14 || $i===19){
        echo "\n";
    }
}
echo "\n";
echo "\n";
// 이해완
for($ii=1; $ii<6; $ii++){
    for($jj=1; $jj<6; $jj++){
        echo "*";
    }
    echo "\n";
}

// 아래처럼 별을 찍어주세요.
// 예시)
// *
// **
// ***
// ****
// *****

$rows = 5;

for ($i = 1; $i <= $rows; $i++) {
    for ($j = 1; $j <= $i; $j++) {
        echo "*";
    }
    echo "\n";
}

// 아래처럼 별을 찍어주세요.
// 예시)
//     *
//    **
//   ***
//  ****
// *****

$rows = 5;


for ($i = 1; $i <= $rows; $i++) {
    for ($k = $rows - $i; $k >= 1; $k--) {
        echo " ";
    }
    
    for ($j = 1; $j <= $i; $j++) {
        echo "*";
    }
    
    echo "\n";
}
echo "\n";

// $qq = 5;
// for($ww = 1; $ww<6; $ww++){
//     for($rr=1; $rr<6; $ww++){
//         if($rr === 2 || $rr === 3 || $rr === 5){
//             continue;
//         }
//     }
// }
